## Plan Result (prod_apim_appgw)




<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * module.app-gw.azurerm_application_gateway.ag[0]
  * module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.app-gw.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw"
    }

  # module.app-gw.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw"
        name                              = "cft-apim00-prod-agw"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
        # (7 unchanged attributes hidden)

      - backend_address_pool {
          - fqdns        = [
              - "firewall-prod-int-palo-cftapimgmtprod.uksouth.cloudapp.azure.com",
            ] -> null
          - id           = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/backendAddressPools/cft-mtls-api-mgmt-appgw" -> null
          - ip_addresses = [] -> null
          - name         = "cft-mtls-api-mgmt-appgw" -> null
        }
      + backend_address_pool {
          + fqdns        = [
              + "firewall-prod-int-palo-cftapimgmtprod.uksouth.cloudapp.azure.com",
            ]
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "civil-sdt"
        }
      + backend_address_pool {
          + fqdns        = [
              + "firewall-prod-int-palo-cftapimgmtprod.uksouth.cloudapp.azure.com",
            ]
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "civil-sdt-commissioning"
        }

      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/backendHttpSettingsCollection/cft-mtls-api-mgmt-appgw" -> null
          - name                                = "cft-mtls-api-mgmt-appgw" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/probes/cft-mtls-api-mgmt-appgw" -> null
          - probe_name                          = "cft-mtls-api-mgmt-appgw" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + host_name                           = "cft-mtls-api-mgmt-appgw.platform.hmcts.net"
          + id                                  = (known after apply)
          + name                                = "civil-sdt"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "civil-sdt"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + host_name                           = "cft-mtls-api-mgmt-appgw.platform.hmcts.net"
          + id                                  = (known after apply)
          + name                                = "civil-sdt-commissioning"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "civil-sdt-commissioning"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }

      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/frontendIPConfigurations/appGwPublicFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPublicFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/frontendPorts/https" -> null
          - frontend_port_name             = "https" -> null
          - host_name                      = "cft-mtls-api-mgmt-appgw.platform.hmcts.net" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/httpListeners/cft-mtls-api-mgmt-appgw" -> null
          - name                           = "cft-mtls-api-mgmt-appgw" -> null
          - protocol                       = "Https" -> null
          - require_sni                    = false -> null
          - ssl_certificate_id             = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/sslCertificates/wildcard-platform-hmcts-net" -> null
          - ssl_certificate_name           = "wildcard-platform-hmcts-net" -> null
          - ssl_profile_id                 = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/sslProfiles/cft-mtls-api-mgmt-appgw-sslprofile" -> null
          - ssl_profile_name               = "cft-mtls-api-mgmt-appgw-sslprofile" -> null
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPublicFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "https"
          + host_name                      = "commissioning.sdt.justice.gov.uk"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "civil-sdt-commissioning"
          + protocol                       = "Https"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "wildcard-platform-hmcts-net"
          + ssl_profile_id                 = (known after apply)
          + ssl_profile_name               = "civil-sdt-commissioning-sslprofile"
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPublicFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "https"
          + host_name                      = "sdt.justice.gov.uk"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "civil-sdt"
          + protocol                       = "Https"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "wildcard-platform-hmcts-net"
          + ssl_profile_id                 = (known after apply)
          + ssl_profile_name               = "civil-sdt-sslprofile"
        }

      - probe {
          - host                                      = "cft-mtls-api-mgmt-appgw.platform.hmcts.net" -> null
          - id                                        = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/probes/cft-mtls-api-mgmt-appgw" -> null
          - interval                                  = 10 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "cft-mtls-api-mgmt-appgw" -> null
          - path                                      = "/status-0123456789abcdef" -> null
          - pick_host_name_from_backend_http_settings = false -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 15 -> null
          - unhealthy_threshold                       = 3 -> null

          - match {
              - status_code = [] -> null
            }
        }
      + probe {
          + host                                      = "civil-sdt-commissioning.platform.hmcts.net"
          + id                                        = (known after apply)
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "civil-sdt-commissioning"
          + path                                      = "/status-0123456789abcdef"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }
      + probe {
          + host                                      = "civil-sdt.platform.hmcts.net"
          + id                                        = (known after apply)
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "civil-sdt"
          + path                                      = "/status-0123456789abcdef"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }

      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/backendAddressPools/cft-mtls-api-mgmt-appgw" -> null
          - backend_address_pool_name  = "cft-mtls-api-mgmt-appgw" -> null
          - backend_http_settings_id   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/backendHttpSettingsCollection/cft-mtls-api-mgmt-appgw" -> null
          - backend_http_settings_name = "cft-mtls-api-mgmt-appgw" -> null
          - http_listener_id           = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/httpListeners/cft-mtls-api-mgmt-appgw" -> null
          - http_listener_name         = "cft-mtls-api-mgmt-appgw" -> null
          - id                         = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/requestRoutingRules/cft-mtls-api-mgmt-appgw" -> null
          - name                       = "cft-mtls-api-mgmt-appgw" -> null
          - priority                   = 10 -> null
          - rewrite_rule_set_id        = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/rewriteRuleSets/cft-mtls-api-mgmt-appgw-rewriterule" -> null
          - rewrite_rule_set_name      = "cft-mtls-api-mgmt-appgw-rewriterule" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "civil-sdt"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "civil-sdt"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "civil-sdt"
          + id                         = (known after apply)
          + name                       = "civil-sdt"
          + priority                   = 20
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "civil-sdt-rewriterule"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "civil-sdt-commissioning"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "civil-sdt-commissioning"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "civil-sdt-commissioning"
          + id                         = (known after apply)
          + name                       = "civil-sdt-commissioning"
          + priority                   = 10
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "civil-sdt-commissioning-rewriterule"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

      ~ rewrite_rule_set {
            id   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/rewriteRuleSets/cft-mtls-api-mgmt-appgw-rewriterule"
          ~ name = "cft-mtls-api-mgmt-appgw-rewriterule" -> "civil-sdt-commissioning-rewriterule"

            # (2 unchanged blocks hidden)
        }
      + rewrite_rule_set {
          + name = "civil-sdt-rewriterule"

          + rewrite_rule {
              + name          = "SdtAddCustomHeadersRule"
              + rule_sequence = 100

              + request_header_configuration {
                  + header_name  = "CLIENT-IP-AGW"
                  + header_value = "{var_client_ip}"
                }
              + request_header_configuration {
                  + header_name  = "X-ARR-ClientCertSub-AGW"
                  + header_value = "{var_client_certificate_subject}"
                }
              + request_header_configuration {
                  + header_name  = "URI-PATH-AGW"
                  + header_value = "{var_uri_path}"
                }
            }
          + rewrite_rule {
              + name          = "SdtUrlRewriteRule"
              + rule_sequence = 200

              + condition {
                  + ignore_case = false
                  + negate      = false
                  + pattern     = ".*/producers(?>-comx)?/service/sdtapi"
                  + variable    = "var_uri_path"
                }

              + url {
                  + components = "path_only"
                  + path       = "/sdt-gateway"
                  + reroute    = false
                }
            }
        }

      ~ ssl_profile {
            id                               = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/sslProfiles/cft-mtls-api-mgmt-appgw-sslprofile"
          ~ name                             = "cft-mtls-api-mgmt-appgw-sslprofile" -> "civil-sdt-commissioning-sslprofile"
          ~ trusted_client_certificate_names = [
              - "cft-mtls-api-mgmt-appgw-trusted-cert",
              + "civil-sdt-commissioning-trusted-cert",
            ]
            # (1 unchanged attribute hidden)
        }
      + ssl_profile {
          + name                             = "civil-sdt-sslprofile"
          + trusted_client_certificate_names = [
              + "civil-sdt-trusted-cert",
            ]
          + verify_client_cert_issuer_dn     = true
        }

      ~ trusted_client_certificate {
            id   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/trustedClientCertificates/cft-mtls-api-mgmt-appgw-trusted-cert"
          ~ name = "cft-mtls-api-mgmt-appgw-trusted-cert" -> "civil-sdt-commissioning-trusted-cert"
            # (1 unchanged attribute hidden)
        }
      + trusted_client_certificate {
          + data = (sensitive value)
          + name = "civil-sdt-trusted-cert"
        }

        # (11 unchanged blocks hidden)
    }

  # module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1955,"Program":"tfcmt","SHA1":"","Target":"prod_apim_appgw","Vars":{}} -->